АлогистикТест2/src/Documents/рфп_ОтгрузкаВагона/рфп_ОтгрузкаВагона.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>рфп_ОтгрузкаВагона</name>
  <registerRecords>AccumulationRegister.алк_ОстаткиНесортированного</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОборотыПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <attributes>
    <name>НомерВагона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладной</name>
    <comment>Номер ЖД накладной</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>_Производитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сертификат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.алк_СтатусыВходящейОтгрузки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрибытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРазгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РазгруженСобственнымиСилами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Загружен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидТранспортировки</name>
    <type>
      <types>EnumRef.алк_ВидыТранспортировки</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтанцияОтправления</name>
    <type>
      <types>CatalogRef.алк_ЛогистическиеЦентры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>_Пиловочник</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Пиловочник</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Порода</name>
      <type>
        <types>CatalogRef.Породы</types>
      </type>
    </attributes>
    <attributes>
      <name>_Порода</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сорт</name>
      <type>
        <types>CatalogRef.Сорта</types>
      </type>
    </attributes>
    <attributes>
      <name>_Сорт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Длина</name>
      <type>
        <types>CatalogRef.Длины</types>
      </type>
    </attributes>
    <attributes>
      <name>_Длина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сечение</name>
      <type>
        <types>CatalogRef.РазмерСечения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Enums/алк_СтатусыВходящейОтгрузки/алк_СтатусыВходящейОтгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_СтатусыВходящейОтгрузки</name>
  <enumValues>
    <name>ВПути</name>
    <comment>Выехал с пункта отправления</comment>
  </enumValues>
  <enumValues>
    <name>Прибыл</name>
    <comment>Транспорт приехал на АЛК</comment>
  </enumValues>
  <enumValues>
    <name>Разгружен</name>
    <comment>Разгрузиди несортированную</comment>
  </enumValues>
  <enumValues>
    <name>Принят</name>
    <comment>Оформлен акт приемки</comment>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Documents/рфп_ОтгрузкаВагона/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ДополнительныеСвойства.Свойство("ОбменДанными") И ДополнительныеСвойства.ОбменДанными.Свойство("Загрузка") И ДополнительныеСвойства.ОбменДанными.Загрузка тогда 
		Возврат;	
	КонецЕсли;
	СвязанныйАктПриемки = Документы.рфп_ОтгрузкаВагона.ПустаяСсылка();
	Если Ссылка <> СвязанныйАктПриемки тогда
		СвязанныйАктПриемки = Документы.алк_ПриемкаЛесопродукции.НайтиПоРеквизиту("Партия", Ссылка);
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Если СвязанныйАктПриемки.Проведен тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Ошибка! Документ не может быть отменен, пока по нему проведен документ приемки лесопродукции",,,,Отказ);
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	Если ДатаРазгрузки < ДатаПрибытия И 
		(Статус = Перечисления.алк_СтатусыВходящейОтгрузки.Принят Или 
		Статус = Перечисления.алк_СтатусыВходящейОтгрузки.Разгружен) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		"Ошибка! Документ не может быть записан. Дата разгрузки не может быть меньше даты прибытия!",,,,Отказ);
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Статус) тогда
		Статус = Перечисления.алк_СтатусыВходящейОтгрузки.ВПути;
	КонецЕсли;
	НомерНакладной = Врег(СтрЗаменить(НомерНакладной, " ", "")); 
	НомерВагона = Врег(СтрЗаменить(НомерВагона, " ", ""));  
	
	Если Не ЗначениеЗаполнено(Участок) Тогда 
		Участок = Справочники.алк_Участки.НайтиПоКоду("000000001");	
	КонецЕсли;
	
	Если СвязанныйАктПриемки.Проведен И Статус <> Перечисления.алк_СтатусыВходящейОтгрузки.Принят Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		"Ошибка! По данному документу есть проведенный документ ""Приемка лесопродукции на биржу"", поменяйте статус на ""Принят""!",,,,Отказ);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Статус = Перечисления.алк_СтатусыВходящейОтгрузки.Прибыл;
	ДатаПрибытия = ТекущаяДата();
	ДатаРазгрузки = Дата(1,1,1);
	Загружен = Ложь;
	Номер = "";
	Дата = ТекущаяДата();
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//Движения.алк_ОстаткиНесортированного.Очистить();
	
	// Инициализация дополнительных свойств для проведения документа.
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа
	Документы.рфп_ОтгрузкаВагона.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета
	РфпСервер.ОтразитьОстаткиНесортированного(ДополнительныеСвойства, Движения, Отказ);
	РфпСервер.ОтразитьОборотыПроизводства(ДополнительныеСвойства, Движения, Отказ);  
	РфпСервер.ОтразитьПроизводствоОборот(ДополнительныеСвойства, Движения, Отказ); 
	
КонецПроцедуры
